AccumulationRegisters/ДенежныеСредстваДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваДисконтныхКарт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПризнакДисконта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыМонетарности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыМонетарности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитнаяДисконтнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитнаяКонтрагент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваДисконтныхКарт/Ext/ManagerModule.bsl
//Костенюк Александр-Старт 17.07.2012
// 
// Функция получает остаток по депозитной дисконтной карте
// 
// Параметры:
// Карта - Тип: СправочникСсылка.ИнформационныеКарты. Карта, по которой нужно получить остаток
// 
// Возвращаемое значение:
// СуммаОстаток - Тип: Число, Строка. Остаток по карте
Функция ПолучитьОстатокДепозитаПоДисконтнойКарте(Карта) Экспорт
	
	Если Карта.ВидДисконтнойКарты.ТипМонетарности = Перечисления.ТипыМонетарности.ДепозитнаяДисконтнаяКарта Тогда
		ПризнакДисконта = Карта;
	ИначеЕсли Карта.ВидДисконтнойКарты.ТипМонетарности = Перечисления.ТипыМонетарности.ДепозитнаяКонтрагент Тогда
		ПризнакДисконта = Карта.ВладелецКарты;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДенежныеСредстваДисконтныхКартОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ДенежныеСредстваДисконтныхКарт.Остатки(, ПризнакДисконта = &ПризнакДисконта) КАК ДенежныеСредстваДисконтныхКартОстатки";
	Запрос.УстановитьПараметр("ПризнакДисконта", ПризнакДисконта);
	
	Резултат 	= Запрос.Выполнить();
	Выборка 	= Резултат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаОстаток = Выборка.СуммаОстаток;
	Иначе
		СуммаОстаток = "";
	КонецЕсли;
	
	Возврат СуммаОстаток;
	
КонецФункции
//Костенюк Александр-Финиш 17.07.2012
